performance-testing/first_delete.yaml
config:
  target: https://scc-project-1-2425.azurewebsites.net/rest
  phases:
    - name: simple_delete
      duration: 1 # how long the test will run for, in seconds
      arrivalRate: 1 # number of arrivals per second.

scenarios:
  - name: simpleDelete
    flow:
      - delete:
          url: /users/john.c?pwd=1234