performance-testing/first_get.yaml
config:
    target: https://scc-project-1-2425.azurewebsites.net/rest
    phases:
        - name: simple_get
          duration: 1 # how long the test will run for, in seconds
          arrivalRate: 1 # number of arrivals per second.

scenarios:
    - name: simpleGet
      flow:
        - get:
            url: /users/john.c?pwd=1234