performance-testing/first_update_user.yaml
config:
  target: https://scc-project-1-2425.azurewebsites.net/rest
  phases:
    - name: simple_update
      duration: 1
      arrivalRate: 1  
scenarios:
  - name: updateUser
    flow:
      - put:
          url: /users/john.c?pwd=1234
          headers:
            Content-Type: application/json
          json:
            userId: "john.c"
            pwd: "1234"
            email: "george@email"
            displayName: "CoolName"